:PROPERTIES:
:ID: A9DB4566-672B-4565-A27E-F28DDB9C00A3
:END:
#+title: Delete
#+description: Delete
#+type: recipe
#+level: cross
#+filetags: :recipe:shell:countries:
#+created: 2026-05-21
#+updated: 2026-06-25

Delete a country by ISO code.

#+name: countries-delete
#+begin_src ores-shell :exports none
countries delete XX
exit
#+end_src

#+begin_src sh :noweb yes :results output :wrap example
printf 'countries delete XX\nexit\n' | \
  ./compass.sh shell -u 'tenant_admin@barclays_plc' -p 'Secure-Password-123' 2>&1
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to nats://localhost:42230
✓ Logged in as: tenant_admin
  Tenant:  (36d4c3c9-195c-46b5-a4d8-b36cb48c8f46)
ORE Studio Shell REPL v0.0.21
Type 'help' for available commands, 'exit' to quit.

ores-shell> ✓ Country XX deleted successfully!
ores-shell> Bye!
#+end_example
